---
title: ViewSheetFailures
classe: Autodesk.Revit.DB.BuiltInFailures+ViewSheetFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ViewSheetFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId ViewInAModelMustBeUnique { get; }` | `ViewSheetFailures.ViewInAModelMustBeUnique` | FailureDefinitionId |
| `FailureDefinitionId ViewInAModelMustBeUniqueWarn { get; }` | `ViewSheetFailures.ViewInAModelMustBeUniqueWarn` | FailureDefinitionId |
| `FailureDefinitionId ViewOnASheetCannotBeUncropped3DPerspectiveView { get; }` | `ViewSheetFailures.ViewOnASheetCannotBeUncropped3DPerspectiveView` | FailureDefinitionId |
| `FailureDefinitionId ViewOnASheetMustBeUnique { get; }` | `ViewSheetFailures.ViewOnASheetMustBeUnique` | FailureDefinitionId |
| `FailureDefinitionId ViewOnASheetMustBeUniqueWarn { get; }` | `ViewSheetFailures.ViewOnASheetMustBeUniqueWarn` | FailureDefinitionId |
| `FailureDefinitionId ViewportCantContainEmptyView { get; }` | `ViewSheetFailures.ViewportCantContainEmptyView` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```